app/views/votos/_form.html.erb

    <%= f.label :candidato_id %><br>
    <%= f.collection_select(:candidato_id ,
    Candidato.order(:numero),:id, :nome) %>
---
SELECT "candidatos".* FROM "candidatos"   ORDER BY "candidatos"."numero" ASC

    <%= f.label :eleitor_id %><br>
    <%= f.collection_select(:eleitor_id ,
    Eleitor.order(:titulo),:id, :nome) %>
---
SELECT "eleitors".* FROM "eleitors"   ORDER BY "eleitors"."titulo" ASC